; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_1 type_3)
 (:predicates (pred_1 ?v8 - type_1 ?v2 - type_2)
 	      (pred_2 ?v1 - object ?v2 - type_2)
	      (pred_4 ?v8 - type_1 ?v7 - type_3)
	      (pred_3 ?v8 - type_1 ?v1 - object ?v7 - type_3))

   (:action op_1
       :parameters  (?v8 - type_1 ?v6 ?v3 - type_2)
       :precondition (and  (pred_1 ?v8 ?v6))
       :effect (and  (pred_1 ?v8 ?v3)
		     (not (pred_1 ?v8 ?v6))))

   (:action op_2
       :parameters (?v8 - type_1 ?v5 - object ?v4 - type_2 ?v7 - type_3)
       :precondition  (and  (pred_2 ?v5 ?v4) (pred_1 ?v8 ?v4) (pred_4 ?v8 ?v7))
       :effect (and (pred_3 ?v8 ?v5 ?v7)
		    (not (pred_2 ?v5 ?v4)) 
		    (not (pred_4 ?v8 ?v7))))

   (:action op_3
       :parameters (?v8 - type_1 ?v5 - object ?v4 - type_2 ?v7 - type_3)
       :precondition  (and  (pred_3 ?v8 ?v5 ?v7) (pred_1 ?v8 ?v4))
       :effect (and (pred_2 ?v5 ?v4)
		    (pred_4 ?v8 ?v7)
		    (not (pred_3 ?v8 ?v5 ?v7)))))

; problem
(define (problem gripper-1-3-3)
(:domain gripper-strips)
(:objects obj_08 - type_1
obj_03 obj_02 - type_3
obj_06 obj_04 obj_09 - type_2
obj_07 obj_05 obj_01 - object)
(:init
(pred_1 obj_08 obj_06)
(pred_4 obj_08 obj_03)
(pred_4 obj_08 obj_02)
(pred_2 obj_07 obj_06)
(pred_2 obj_05 obj_09)
(pred_2 obj_01 obj_09)
)
(:goal
(and
(pred_2 obj_07 obj_09)
(pred_2 obj_05 obj_06)
(pred_2 obj_01 obj_09)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_3 obj_08 ?b obj_02))))
)
)

; plan
1. (op_2 obj_08 obj_07 obj_06 obj_03)
   deleted: (pred_2 obj_07 obj_06) (pred_4 obj_08 obj_03)
   added: (pred_3 obj_08 obj_07 obj_03)
   goals met: 1 of 3
2. (op_1 obj_08 obj_06 obj_09)
   deleted: (pred_1 obj_08 obj_06)
   added: (pred_1 obj_08 obj_09)
   goals met: 1 of 3
3. (op_3 obj_08 obj_07 obj_09 obj_03)
   deleted: (pred_3 obj_08 obj_07 obj_03)
   added: (pred_2 obj_07 obj_09) (pred_4 obj_08 obj_03)
   goals met: 2 of 3
4. (op_2 obj_08 obj_05 obj_09 obj_03)
   deleted: (pred_2 obj_05 obj_09) (pred_4 obj_08 obj_03)
   added: (pred_3 obj_08 obj_05 obj_03)
   goals met: 2 of 3
5. (op_1 obj_08 obj_09 obj_06)
   deleted: (pred_1 obj_08 obj_09)
   added: (pred_1 obj_08 obj_06)
   goals met: 2 of 3
6. (op_3 obj_08 obj_05 obj_06 obj_03)
   deleted: (pred_3 obj_08 obj_05 obj_03)
   added: (pred_2 obj_05 obj_06) (pred_4 obj_08 obj_03)
   goals met: 3 of 3
